Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/migrant_workers/finding_a_job_when_you_move_to_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Finding a job in Ireland
ga: Post a fháil in Éirinn

source: If you are moving to Ireland or considering re-locating here, finding a job is probably going to be one of your priorities
ga: Má tá tú ag bogadh go hÉirinn nó má tá tú ag machnamh faoi athlonnú abhus, is dócha gur ceann amháin de do chuid tosaíochtaí é post a fháil

source: It is advisable to have employment and possibly some accommodation organised in advance of your journey but it is not a requirement
ga: Moltar duit an fhostaíocht agus lóistín éigin, más féidir, a bheith eagraithe agat roimh d'aistear ach ní riachtanas é seo

source: If you are planning to move country, it makes sense to do some research into the opportunities available here, the average rates of pay and taxation issues and to ensure there are no restrictions that would preclude you from working here
ga: Má tá tú ag pleanáil le bogadh tíre, luíonn sé le réasún go ndéanfá roinnt taighde faoi na deiseanna atá ar fáil anseo, faoi na meán-rátaí pá agus faoi shaincheisteanna cánachais agus go gcinnteofá nach bhfuil aon srianta ann a chuirfeadh cosc ort óna dhul ag obair sa tír seo

source: The Citizens Information website does not carry any information about job vacancies for any sector of the Irish economy
ga: Ní bhíonn aon eolas faoi fholúntais d'earnáil ar bith den gheilleagar Éireannach ag CitizensInformation.ie

source: It does not accept CVs/resumes and cannot forward them to employers on your behalf
ga: Ní ghlacann CitizensInformation.ie le Curricula Vitae/dintiúir agus ní féidir iad a chur ar aghaidh chuig fostóirí ar do shonsa

source: Recruitment agencies in Ireland offer a wide range of employment opportunities - from casual employment to specialised skills - see 'Where to apply' below
ga: Tá raon leathan d'áisíneachtaí earcaíochta in Éirinn a sholáthraíonn eolas faoi phoist in Éirinn (féach 'Cá háit a ndéanfaidh mé iarratas' thíos)

source: This document will provide you with information and advice about coming to work in Ireland and your rights when finding and securing a job as a foreign national employee in Ireland
ga: Tabharfaidh an cháipéis seo eolas agus comhairle duit faoi teacht chun bheith ag obair in Éirinn agus do chearta má tá tú ag lorg agus ag fáil poist mar fhostaí náisiúnach eachtrach in Éirinn

source: Quality and Qualifications Ireland is the Irish centre for the recognition of international qualifications
ga: Is é Dearbhú Cáilíochta agus Cáilíochtaí Éireann an t-ionad Éireannach a aithníonn cáilíochtaí idirnáisiúnta

source: It has an International Qualifications Database
ga: Tá Bunachar Sonraí Cáilíochtaí Idirnáisiúnta aige

source: You need to know about how qualifications are recognised in Ireland and about the mutual recognition of professional qualifications
ga: Caithfidh tú eolas a bheith agat ar an dóigh a aithnítear cáilíochtaí in Éirinn agus faoi comhaitheantas cáilíochtaí gairmiúla

source: If you have a professional qualification, you should check with the Irish branch of your professional body as to whether your qualifications are acceptable for use in Ireland - see 'Professions and careers' below
ga: Má tá cáilíocht phroifisiúnta agat, ba cheart duit seiceáil leis an gcraobh Éireannach de do chomhlacht gairmiúil lena fháil amach an bhfuil do cháilíochtaí inghlactha le húsáid in Éirinn – féach 'Gairmeacha' thíos

source: If you are an EEA or Swiss national coming to work in Ireland, you are entitled to be treated like any other applicant when you apply for work
ga: Más saoránach LEE nó Eilvéiseach thú ag teacht chun bheith ag obair in Éirinn, tá tú i dteideal go ndéileáfar leat cosúil le hiarrthóir ar bith eile nuair a chuireann tú iarratas isteach ar obair

source: You are free to apply for any job vacancy, including jobs in the public sector
ga: Tá cead agat cur isteach ar aon fholúntas oibre, lena n-áirítear poist san earnáil phoiblí

source: These include jobs in the Irish army and the Irish police force (An Garda Síochána), but not the Irish diplomatic service
ga: Cuimsíonn siad seo poist in Óglaigh na hÉireann agus i bhfórsa póilíneachta na hÉireann (An Garda Síochána), ach ní le seirbhís taidhleoireachta na hÉireann

source: Note: the EEA (European Economic Area) comprises the European Union (EU) member states, Norway, Iceland and Liechtenstein
ga: Nóta: is é atá san LEE (EEA i mBéarla) ná ballstáit an AE, an Iorua, an Íoslainn agus Lichtinstéin

source: European Employment Services (EURES)
ga: Seirbhísí Fostaíochta Eorpacha (EURES)

source: Citizens of the EU/EEA are free to live and work in other member states without restriction
ga: Tá an tsaoirse ag saoránaigh de chuid an AE/LEE chun cónaí agus obair i mBallstáit eile gan srianadh

source: To facilitate the free movement of workers between member states, the EURES network consisting of the public employment service and the European Commission in each country has been established
ga: Chun saorghluaiseacht oibrithe idir ballstáit a éascú, bunaíodh líonra i ngach tír arb í an tseirbhís fostaíochta phoiblí agus an Coimisiún Eorpach atá inti

source: • Provide a European Job Placement Services for jobseekers
ga: • Seirbhís Socrúcháin i bPoist Eorpacha a sholáthar do dhaoine a bhíonn ag lorg post

source: • Offer advice and guidance on how to look for a job in the EEA and the possibilities that exist for finding work in another country
ga: • Seirbhís earcaíochta a sholáthar d'fhostóirí ar mian leo dul i mbun earcaíochta sna Ballstáit LEE

source: • Provide a recruitment service to employers who wish to recruit in EEA member states
ga: • Eolas faoi choinníollacha cónaithe agus oibre sna Ballstáit de chuid an LEE a sholáthar

source: • Provide information on living and working conditions in EEA member states
ga: • Seirbhís earcaíochta a sholáthar d'fhostóirí ar mian leo dul i mbun earcaíochta sna Ballstáit LEE

source: Within each EU/EEA member state, specially trained placement officers (called EURES Advisers) provide free information and advice to workers and employers about all of the above issues
ga: Laistigh de gach Ballstát de chuid an AE/LEE, soláthraíonn Oifigigh Socrúcháin (dá ngairtear comhairleoirí EURES) ar oiliúnaithe go speisialta iad eolas agus comhairle shaor in aisce d'oibrithe agus d'fhostóirí faoi gach ceann de na saincheisteanna thuas

source: EEA jobseekers who wish to work in another member state will obtain information on jobs and information on living/working conditions in the EEA here
ga: Gheobhaidh na daoine a bhíonn ag lorg post agus gur ón AE/LEE iad, agus ar mian leo obair i mBallstát eile eolas ar phoist agus eolas ar choinníollacha cónaithe/oibre san LEE anseo

source: If you are looking for work, you can also post your CV on the EURES website where it can be accessed by thousands of employers throughout the EEA
ga: Má tá tú ag lorg oibre, féadfaidh tú do Churriculum Vitae a chur ar shuíomh gréasáin EURES, áit ar féidir leis na mílte fostóirí ó fud an LEE é a shroichint

source: This will help maximise your chances of securing employment
ga: Tabharfaidh sé seo an seans is fearr duit chun fostaíocht a fháil

source: In general non-EEA nationals (apart from some exceptions) must have a employment permit to work in Ireland
ga: Go ginearálta ní mór do shaoránaigh neamh-LEE (ach amháin eisceachtaí) cead fostaíochta a bheith acu le bheith ag obair in Éirinn

source: From 12 October 2007 non-EEA nationals who are carrying out scientific research for approved research organisations do not need an employment permit
ga: Ón 18 Deireadh Fomhair 2007 má bíonn náisiúnaigh neamh-LEE ag déanamh taighde eolaíoch le eagraíochtaí eolaíocha ceadaithe, ní bheidh cead fostaíochta uirthi

source: The arrangements for employment permits include:
ga: Beidh na rudaí seo a leanas ar na socruithe do cheadanna fostaíochta:

source: • Critical Skills Employment Permits which are available for all occupations with an annual salary above €60,000 and for a restricted range of occupations with an annual salary above €30,000
ga: • Cead Fostaíochta Scileanna Ríthábhachtacha atá ar fáil do gach post a bhfuil tuarastal bliantúil ag dul leis os cionn €60,000 agus do réimse teoranta post le tuarastal bliantúil os cionn €30,000

source: • General Employment Permits which are available mainly for occupations with salaries between €30,000 and €60,000 which are not eligible for a Critical Skills Employment Permit
ga: • Cead Fostaíochta Ginearálta atá ar fáil go príomha do phoist a bhfuil tuarastal idir €30,000 agus €60,000 acu agus nach bhfuil incháilithe do Chead Fostaíochta Scileanna Ríthábhactacha

source: The General Employment Permit application must meet a labour market test showing that the position could not be filled from within the EEA
ga: Caithfidh an t-iarratas ar Chead Fostaíochta Ginearálta tástáil an mhargaidh shaothair a chomhlíonadh ag léiriú nach bhféadfaí an folúntas a líonadh ó laistigh den LEE

source: Your nearest Irish embassy or consulate will be able to advise on whether you require a travel visa before coming to Ireland
ga: Beidh an ambasáid nó an chonsalacht Éireannach is cóngaraí duit in ann comhairliú duit an mbeidh víosa de dhíth ort sula dtagann tú go hÉirinn nó nach mbeidh

source: These jobs are often advertised in shop windows, in shopping centres, through daily Irish newspapers and through employment agencies
ga: Is minic na poist seo á bhfógairt i bhfuinneoga siopaí, in ionaid siopadóireachta, trí na páipéir nuachtáin laethúla Éireannacha agus trí áisíneachtaí earcaíochta

source: While many of these jobs do not require any specific professional qualifications, it is advisable to bring evidence of any educational standards (such as secondary school certificates, diplomas, and degrees) you have attained with you to Ireland
ga: Cé nach mbíonn aon cháilíochtaí gairmiúla de dhíth ar go leor de na poist sin, moltar duit fianaise um chaighdeáin oideachasúla ar bith a ghnóthaigh tú (.i. teastais iar-bhunscoileanna, dioplómaí, céimeanna, srl.) a thabhairt leat go hÉirinn

source: It is also useful to bring an up-to-date résumé/CV in the English language with you as you may be requested to supply information on any experience or expertise you may have
ga: B'áisiúil an ní é freisin dá dtabharfá CV/dintiúir sa Bhéarla ar suas chun dáta iad leat, óir gur dócha go n-iarrfaí ort eolas a sholáthar ar aon taithí nó aon saineolas a bheadh agat

source: If you are planning to come to Ireland and are seeking casual employment, you could register with a recruitment agency in advance of your journey
ga: Má tá tú ag pleanáil chun teacht go hÉirinn agus go bhfuil tú ag féachaint le corr-fhostaíocht a fháil, d’fhéadfá clárú le háisíneacht earcaíochta roimh d’aistear abhus

source: You should also keep an eye on advertisements for casual workers in shops/stores
ga: Ba chóir duit súil a choinneáil amach freisin ar fhógraí do chorr-oibrithe sna siopaí féin

source: Finding a career job in Ireland will involve a little more planning than looking for casual work
ga: Beidh níos mó pleanála ag teastáil chun post gairmiúil a fháil in Éirinn ná mar a bheidh i gcás corr-oibre

source: While a career job may take a little longer to secure, you are advised get organised and start applying for jobs before you travel
ga: Cé go dtógfadh post gairmiúil píosa breise ama lena fháil, moltar duit tú féin a eagrú agus chun tosú ag cur isteach ar phoist sula dtaistilíonn tú

source: It is also useful to bear in mind that these jobs are generally paid at a higher level than other jobs that do not require any qualifications
ga: B'áisiúil duit freisin a mheabhrú go n-íoctar tuarastail ar leibhéal níos airde sna poist seo thairis poist eile nach dteastaíonn aon cháilíochtaí dóibh

source: Almost all professions in Ireland have associations or societies in Ireland that represent and often regulate their members
ga: Tá cumainn nó comhaltais in Éirinn ag nach mór gach uile ghairm in Éirinn a dhéanann ionadaíocht dá gcuid ball agus ar minic go rialaíonn siad iad freisin

source: These associations will provide information on recognition of professional qualifications, employment opportunities and careers
ga: Soláthróidh na cumainn sin eolas um aithint cháilíochtaí gairmiúla, um dheiseanna fostaíochta agus um ghairmeacha

source: Almost all of these organisations have their own websites (pdf), which you can search for online using any good search engine
ga: Tá a chuid láithreán gréasáin féin ag nach mór gach aon cheann de na heagrais seo (pdf), ar féidir leat cuardach ina leith ar líne ag baint leasa as aon inneall cuardaigh ar fios a ghnóithe dó

source: All employees, irrespective of their nationality, experience, expertise or profession, are protected by the law in Ireland
ga: Tugtar cosaint do gach fostaí in Éirinn - beag beann ar a náisiúntacht, a dtaithí, a saineolas nó a ngairm – faoin dlí in Éirinn

source: These laws set down specific rules about minimum rates of pay, working hours, leave, health and safety, changing jobs and employment rights
ga: Leagann na dlithe seo síos rialacha sonracha faoi íosrátaí pá, faoi uaireanta oibre, faoi shaoire, faoin tsláinte agus an tsábháilteacht, faoi phoist a athrú agus faoi chearta fostaíochta

source: For commercial reasons, it is not possible for the Citizens Information website to carry information about actual job vacancies, specific employment opportunities or information on careers in Ireland
ga: De bharr chúiseanna tráchtála, ní féidir le CitizensInformation.ie eolas a thaispeáint faoi fholúntais do phoist atá ar fáil, ná faoi dheiseanna fostaíochta faoi leith ná eolas ar ghairmeacha in Éirinn

source: The Citizens Information website cannot accept résumés/CVs or provide information on specific career paths
ga: Ní féidir le CitizensInformation.ie glacadh le dintiúir/ le Curricula Vitae ná eolas a sholáthar um bealaí gairmréime faoi leith

source: If you are applying for a job in Ireland through a recruitment agency, it's worth bearing in mind that it is very unusual that you are charged for these services
ga: Is é an gnáthnós é d'áisíneachtaí earcaíochta in Éirinn táille a ghearradh ar dhaoine dá gcuid seirbhísí

source: When you apply for a job you need to have a curriculum vitae (CV) or resumé in English which is a summary or listing of your qualifications and work experience
ga: Nuair a dhéanann tú iarratas ar phost ní mór duit curriculum vitae (CV) a bheith agat i mBéarla ar achoimre é nó liosta de do cháilíochtaí agus do thaithí oibre

source: You also should have original copies of your qualifications and official copies of them in English
ga: Ba chóir duit bunchóipeanna de do cháilíochtaí agus cóipeanna oifigiúla díobh i mBéarla a bheith agat chomh maith

source: If you are in Ireland and you need to have documents translated into English you can contact the embassy or consulate of your country for assistance
ga: Má tá tú in Éirinn agus gur gá duit cáipéisí a bheith aistrithe go Béarla, is féidir leat dul i dteagmháil le hambasáid nó consalacht na tíre chun cabhair a fháil

source: Qualifications recognition: you can download a comparability statement for your qualification and a user guide (pdf) from qqi.ie
ga: Aitheantas cáilíochtaí: is féidir ráiteas inchomparáideachta le haghaidh do cháilíocht agus treoir úsáideora (pdf) ó qqi.ie a íoslódáil

source: If you are seeking employment in Ireland, the job advertisement or recruitment agency will advise you how to apply for the job
ga: Má tá tú ag lorg fostaíochta in Éirinn, cuirfidh an fógra poist nó gníomhaireacht earcaíochta comhairle ort maidir le conas iarratas a dhéanamh ar an bpost

source: If you are a non-EEA national you can find out more information about General Employment Permits and Critical Skills Employment Permits on the website of the Department of Jobs, Enterprise and Innovation
ga: Murar náisiúnach de chuid LEE tú, is féidir leat tuilleadh eolais a fháil maidir le Ceadanna Fostaíochta Ginearálta agus Ceadanna Fostaíochta Scileanna Ríthábhactacha ar láithreán gréasáin den Roinn Post, Fiontar agus Nuálaíochta

source: If you need a visa you must apply online for an Irish visa
ga: Má víosa de dhíth ort, caithfidh tú iarratas ar líne ar víosa a dhéanamh

source: Contact information for recruitment agencies in Ireland is available in the telephone directory or through an online search
ga: Tá fáil ar eolas teagmhála d'áisíneachtaí earcaíochta in Éirinn san eolaí teileafóin nó trí chuardach ar líne
